In [1]:
import numpy as np
import pandas as pd

In [2]:
# nan = not avaliable number

In [5]:
revenue_series = pd.Series([100,200,300,np.nan], index=['Mercedes', 'Audi','BMW','Toyota'])
print(revenue_series)

Mercedes    100.0
Audi        200.0
BMW         300.0
Toyota        NaN
dtype: float64

In [8]:
revenue_series.isnull()

Mercedes    False
Audi        False
BMW         False
Toyota       True
dtype: bool

In [10]:
revenue_series.dropna()

Mercedes    100.0
Audi        200.0
BMW         300.0
dtype: float64

In [11]:
df1 = pd.DataFrame(np.random.rand(12).reshape(4,3))
df1

          0         1         2
0  0.271737  0.970872  0.757104
1  0.932422  0.360606  0.073828
2  0.430282  0.753244  0.010028
3  0.042137  0.852151  0.056699

In [12]:
df1.loc[1,2] = np.nan
df1.loc[2,1] = np.nan
df1.loc[3,:] = np.nan
df1

          0         1         2
0  0.271737  0.970872  0.757104
1  0.932422  0.360606       NaN
2  0.430282       NaN  0.010028
3       NaN       NaN       NaN

In [13]:
df1.dropna()

          0         1         2
0  0.271737  0.970872  0.757104

In [15]:
df1.dropna(how='all')

          0         1         2
0  0.271737  0.970872  0.757104
1  0.932422  0.360606       NaN
2  0.430282       NaN  0.010028

In [16]:
df1.dropna(axis=1)   # along column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
df2 = pd.DataFrame([[1,2,3,np.nan], [4,5,6,7], [8,9,np.nan,np.nan], [12,np.nan,np.nan,np.nan]])
df2

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  5.0  6.0  7.0
2   8  9.0  NaN  NaN
3  12  NaN  NaN  NaN

In [20]:
df2.dropna(thresh=3)   # atleast 3 non-null values should be present in a row, else the row will be deleted

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0

In [21]:
df2.fillna(0)

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  5.0  6.0  7.0
2   8  9.0  0.0  0.0
3  12  0.0  0.0  0.0

In [23]:
df2.fillna({0:0, 1:50, 2:100, 3:150})    # fill column wise

    0     1      2      3
0   1   2.0    3.0  150.0
1   4   5.0    6.0    7.0
2   8   9.0  100.0  150.0
3  12  50.0  100.0  150.0